insert into item (category, location_x, location_y, state)
values('wallet', 3,5, '보관중');


-- 모든 상태가 '분실'인 테스트 데이터
INSERT INTO item_lost (name, phone, category, color, gate, state)
VALUES
('김분실', '010-1111-2222', '카드지갑', '검정색', 1, '분실'),
('박미정', '010-3333-4444', '블루투스 이어폰', '화이트', 2, '분실'),
('이현우', '010-5555-6666', '백팩', '회색', 1, '분실'),
('최지수', '010-7777-8888', '태블릿', '스페이스그레이', 2, '분실'),
('정무명', '010-0000-0000', '장우산', '투명', 1, '분실');
-- 다양한 아이템 데이터 입력
INSERT INTO item (category, color, location_x, location_y, state)
VALUES
('지갑', '검정색', 37.5665, 126.9780, '분실'),
('스마트폰', '실버', 37.4979, 127.0276, '보관중'),
('에어팟', '화이트', 37.5123, 127.1025, '분실'),
('가방', '네이비', 37.5511, 126.9363, '보관중'),
('우산', '노란색', 37.5401, 127.0694, '찾음');